platformio/platform-ststm32/misc/svd/STM32H757_CM4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>I2C</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C1_EV</name>
        <description>I2C1 event interrupt</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>I2C1_ER</name>
        <description>I2C1 error interrupt</description>
        <value>32</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>Access: No wait states, except if a write
          access occurs while a write access to this register is
          ongoing. In this case, wait states are inserted in the
          second write access until the previous one is completed.
          The latency of the second write access can be up to 2 x
          PCLK1 + 6 x I2CCLK.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PE</name>
              <description>Peripheral enable Note: When PE=0, the
              I2C SCL and SDA lines are released. Internal state
              machines and status bits are put back to their reset
              value. When cleared, PE must be kept low for at least
              3 APB clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXIE</name>
              <description>TX Interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXIE</name>
              <description>RX Interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDRIE</name>
              <description>Address match Interrupt enable (slave
              only)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACKIE</name>
              <description>Not acknowledge received Interrupt
              enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPIE</name>
              <description>STOP detection Interrupt
              enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete interrupt enable Note:
              Any of these events will generate an interrupt:
              Transfer Complete (TC) Transfer Complete Reload
              (TCR)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupts enable Note: Any of
              these errors generate an interrupt: Arbitration Loss
              (ARLO) Bus Error detection (BERR) Overrun/Underrun
              (OVR) Timeout detection (TIMEOUT) PEC error detection
              (PECERR) Alert pin event detection
              (ALERT)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DNF</name>
              <description>Digital noise filter These bits are used
              to configure the digital noise filter on SDA and SCL
              input. The digital filter will filter spikes with a
              length of up to DNF[3:0] * tI2CCLK ... Note: If the
              analog filter is also enabled, the digital filter is
              added to the analog filter. This filter can only be
              programmed when the I2C is disabled (PE =
              0).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ANFOFF</name>
              <description>Analog noise filter OFF Note: This bit
              can only be programmed when the I2C is disabled (PE =
              0).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>DMA transmission requests
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>DMA reception requests
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBC</name>
              <description>Slave byte control This bit is used to
              enable hardware byte control in slave
              mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOSTRETCH</name>
              <description>Clock stretching disable This bit is
              used to disable clock stretching in slave mode. It
              must be kept cleared in master mode. Note: This bit
              can only be programmed when the I2C is disabled (PE =
              0).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN</name>
              <description>Wakeup from Stop mode enable Note: If
              the Wakeup from Stop mode feature is not supported,
              this bit is reserved and forced by hardware to 0.
              Please refer to Section25.3: I2C implementation.
              Note: WUPEN can be set only when DNF =
              0000</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCEN</name>
              <description>General call enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMBHEN</name>
              <description>SMBus Host address enable Note: If the
              SMBus feature is not supported, this bit is reserved
              and forced by hardware to 0. Please refer to
              Section25.3: I2C implementation.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMBDEN</name>
              <description>SMBus Device Default address enable
              Note: If the SMBus feature is not supported, this bit
              is reserved and forced by hardware to 0. Please refer
              to Section25.3: I2C implementation.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALERTEN</name>
              <description>SMBus alert enable Device mode
              (SMBHEN=0): Host mode (SMBHEN=1): Note: When
              ALERTEN=0, the SMBA pin can be used as a standard
              GPIO. If the SMBus feature is not supported, this bit
              is reserved and forced by hardware to 0. Please refer
              to Section25.3: I2C implementation.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECEN</name>
              <description>PEC enable Note: If the SMBus feature is
              not supported, this bit is reserved and forced by
              hardware to 0. Please refer to Section25.3: I2C
              implementation.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>Access: No wait states, except if a write
          access occurs while a write access to this register is
          ongoing. In this case, wait states are inserted in the
          second write access until the previous one is completed.
          The latency of the second write access can be up to 2 x
          PCLK1 + 6 x I2CCLK.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SADD0</name>
              <description>Slave address bit 0 (master mode) In
              7-bit addressing mode (ADD10 = 0): This bit is dont
              care In 10-bit addressing mode (ADD10 = 1): This bit
              should be written with bit 0 of the slave address to
              be sent Note: Changing these bits when the START bit
              is set is not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD1</name>
              <description>Slave address bit 7:1 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits should
              be written with the 7-bit slave address to be sent In
              10-bit addressing mode (ADD10 = 1): These bits should
              be written with bits 7:1 of the slave address to be
              sent. Note: Changing these bits when the START bit is
              set is not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD2</name>
              <description>Slave address bit 7:1 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits should
              be written with the 7-bit slave address to be sent In
              10-bit addressing mode (ADD10 = 1): These bits should
              be written with bits 7:1 of the slave address to be
              sent. Note: Changing these bits when the START bit is
              set is not allowed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD3</name>
              <description>Slave address bit 7:1 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits should
              be written with the 7-bit slave address to be sent In
              10-bit addressing mode (ADD10 = 1): These bits should
              be written with bits 7:1 of the slave address to be
              sent. Note: Changing these bits when the START bit is
              set is not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD4</name>
              <description>Slave address bit 7:1 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits should
              be written with the 7-bit slave address to be sent In
              10-bit addressing mode (ADD10 = 1): These bits should
              be written with bits 7:1 of the slave address to be
              sent. Note: Changing these bits when the START bit is
              set is not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD5</name>
              <description>Slave address bit 7:1 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits should
              be written with the 7-bit slave address to be sent In
              10-bit addressing mode (ADD10 = 1): These bits should
              be written with bits 7:1 of the slave address to be
              sent. Note: Changing these bits when the START bit is
              set is not allowed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD6</name>
              <description>Slave address bit 7:1 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits should
              be written with the 7-bit slave address to be sent In
              10-bit addressing mode (ADD10 = 1): These bits should
              be written with bits 7:1 of the slave address to be
              sent. Note: Changing these bits when the START bit is
              set is not allowed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD7</name>
              <description>Slave address bit 7:1 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits should
              be written with the 7-bit slave address to be sent In
              10-bit addressing mode (ADD10 = 1): These bits should
              be written with bits 7:1 of the slave address to be
              sent. Note: Changing these bits when the START bit is
              set is not allowed.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD8</name>
              <description>Slave address bit 9:8 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits are
              dont care In 10-bit addressing mode (ADD10 = 1):
              These bits should be written with bits 9:8 of the
              slave address to be sent Note: Changing these bits
              when the START bit is set is not
              allowed.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD9</name>
              <description>Slave address bit 9:8 (master mode) In
              7-bit addressing mode (ADD10 = 0): These bits are
              dont care In 10-bit addressing mode (ADD10 = 1):
              These bits should be written with bits 9:8 of the
              slave address to be sent Note: Changing these bits
              when the START bit is set is not
              allowed.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_WRN</name>
              <description>Transfer direction (master mode) Note:
              Changing this bit when the START bit is set is not
              allowed.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD10</name>
              <description>10-bit addressing mode (master mode)
              Note: Changing this bit when the START bit is set is
              not allowed.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HEAD10R</name>
              <description>10-bit address header only read
              direction (master receiver mode) Note: Changing this
              bit when the START bit is set is not
              allowed.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>Start generation This bit is set by
              software, and cleared by hardware after the Start
              followed by the address sequence is sent, by an
              arbitration loss, by a timeout error detection, or
              when PE = 0. It can also be cleared by software by
              writing 1 to the ADDRCF bit in the I2C_ICR register.
              If the I2C is already in master mode with AUTOEND =
              0, setting this bit generates a Repeated Start
              condition when RELOAD=0, after the end of the NBYTES
              transfer. Otherwise setting this bit will generate a
              START condition once the bus is free. Note: Writing 0
              to this bit has no effect. The START bit can be set
              even if the bus is BUSY or I2C is in slave mode. This
              bit has no effect when RELOAD is set.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop generation (master mode) The bit is
              set by software, cleared by hardware when a Stop
              condition is detected, or when PE = 0. In Master
              Mode: Note: Writing 0 to this bit has no
              effect.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACK</name>
              <description>NACK generation (slave mode) The bit is
              set by software, cleared by hardware when the NACK is
              sent, or when a STOP condition or an Address matched
              is received, or when PE=0. Note: Writing 0 to this
              bit has no effect. This bit is used in slave mode
              only: in master receiver mode, NACK is automatically
              generated after last byte preceding STOP or RESTART
              condition, whatever the NACK bit value. When an
              overrun occurs in slave receiver NOSTRETCH mode, a
              NACK is automatically generated whatever the NACK bit
              value. When hardware PEC checking is enabled
              (PECBYTE=1), the PEC acknowledge value does not
              depend on the NACK value.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBYTES</name>
              <description>Number of bytes The number of bytes to
              be transmitted/received is programmed there. This
              field is dont care in slave mode with SBC=0. Note:
              Changing these bits when the START bit is set is not
              allowed.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RELOAD</name>
              <description>NBYTES reload mode This bit is set and
              cleared by software.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTOEND</name>
              <description>Automatic end mode (master mode) This
              bit is set and cleared by software. Note: This bit
              has no effect in slave mode or when the RELOAD bit is
              set.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECBYTE</name>
              <description>Packet error checking byte This bit is
              set by software, and cleared by hardware when the PEC
              is transferred, or when a STOP condition or an
              Address matched is received, also when PE=0. Note:
              Writing 0 to this bit has no effect. This bit has no
              effect when RELOAD is set. This bit has no effect is
              slave mode when SBC=0. If the SMBus feature is not
              supported, this bit is reserved and forced by
              hardware to 0. Please refer to Section25.3: I2C
              implementation.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR1</name>
          <displayName>OAR1</displayName>
          <description>Access: No wait states, except if a write
          access occurs while a write access to this register is
          ongoing. In this case, wait states are inserted in the
          second write access until the previous one is completed.
          The latency of the second write access can be up to 2 x
          PCLK1 + 6 x I2CCLK.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OA1</name>
              <description>Interface address 7-bit addressing mode:
              dont care 10-bit addressing mode: bits 9:8 of address
              Note: These bits can be written only when OA1EN=0.
              OA1[7:1]: Interface address Bits 7:1 of address Note:
              These bits can be written only when OA1EN=0. OA1[0]:
              Interface address 7-bit addressing mode: dont care
              10-bit addressing mode: bit 0 of address Note: This
              bit can be written only when OA1EN=0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>OA1MODE</name>
              <description>Own Address 1 10-bit mode Note: This bit
              can be written only when OA1EN=0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OA1EN</name>
              <description>Own Address 1 enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR2</name>
          <displayName>OAR2</displayName>
          <description>Access: No wait states, except if a write
          access occurs while a write access to this register is
          ongoing. In this case, wait states are inserted in the
          second write access until the previous one is completed.
          The latency of the second write access can be up to 2 x
          PCLK1 + 6 x I2CCLK.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OA2</name>
              <description>Interface address bits 7:1 of address
              Note: These bits can be written only when
              OA2EN=0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>OA2MSK</name>
              <description>Own Address 2 masks Note: These bits can
              be written only when OA2EN=0. As soon as OA2MSK is
              not equal to 0, the reserved I2C addresses (0b0000xxx
              and 0b1111xxx) are not acknowledged even if the
              comparison matches.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OA2EN</name>
              <description>Own Address 2 enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
